dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxSpu_reg.h
/** \brief 534, Monitor CRC Register */
#define SPU0_CRC_CTRL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800534u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL13.
* To use register names with standard convension, please use SPU0_CRC_CTRL13.
*/
#define SPU0_CTRL13_CRC (SPU0_CRC_CTRL13)

/** \brief 538, Monitor CRC Register */
#define SPU0_CRC_CTRL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800538u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL14.
* To use register names with standard convension, please use SPU0_CRC_CTRL14.
*/
#define SPU0_CTRL14_CRC (SPU0_CRC_CTRL14)

/** \brief 53C, Monitor CRC Register */
#define SPU0_CRC_CTRL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA80053Cu)
/** Alias (User Manual Name) for SPU0_CRC_CTRL15.
* To use register names with standard convension, please use SPU0_CRC_CTRL15.
*/
#define SPU0_CTRL15_CRC (SPU0_CRC_CTRL15)

/** \brief 540, Monitor CRC Register */
#define SPU0_CRC_CTRL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800540u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL16.
* To use register names with standard convension, please use SPU0_CRC_CTRL16.
*/
#define SPU0_CTRL16_CRC (SPU0_CRC_CTRL16)

/** \brief 544, Monitor CRC Register */
#define SPU0_CRC_CTRL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800544u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL17.
* To use register names with standard convension, please use SPU0_CRC_CTRL17.
*/
#define SPU0_CTRL17_CRC (SPU0_CRC_CTRL17)

/** \brief 548, Monitor CRC Register */
#define SPU0_CRC_CTRL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800548u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL18.
* To use register names with standard convension, please use SPU0_CRC_CTRL18.
*/
#define SPU0_CTRL18_CRC (SPU0_CRC_CTRL18)

/** \brief 54C, Monitor CRC Register */
#define SPU0_CRC_CTRL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA80054Cu)
/** Alias (User Manual Name) for SPU0_CRC_CTRL19.
* To use register names with standard convension, please use SPU0_CRC_CTRL19.
*/
#define SPU0_CTRL19_CRC (SPU0_CRC_CTRL19)

/** \brief 550, Monitor CRC Register */
#define SPU0_CRC_CTRL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800550u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL20.
* To use register names with standard convension, please use SPU0_CRC_CTRL20.
*/
#define SPU0_CTRL20_CRC (SPU0_CRC_CTRL20)

/** \brief 554, Monitor CRC Register */
#define SPU0_CRC_CTRL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800554u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL21.
* To use register names with standard convension, please use SPU0_CRC_CTRL21.
*/
#define SPU0_CTRL21_CRC (SPU0_CRC_CTRL21)

/** \brief 558, Monitor CRC Register */
#define SPU0_CRC_CTRL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800558u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL22.
* To use register names with standard convension, please use SPU0_CRC_CTRL22.
*/
#define SPU0_CTRL22_CRC (SPU0_CRC_CTRL22)

/** \brief 55C, Monitor CRC Register */
#define SPU0_CRC_CTRL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA80055Cu)
/** Alias (User Manual Name) for SPU0_CRC_CTRL23.
* To use register names with standard convension, please use SPU0_CRC_CTRL23.
*/
#define SPU0_CTRL23_CRC (SPU0_CRC_CTRL23)

/** \brief 560, Monitor CRC Register */
#define SPU0_CRC_CTRL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_CRC_CTRL*)0xFA800560u)
/** Alias (User Manual Name) for SPU0_CRC_CTRL24.
* To use register names with standard convension, please use SPU0_CRC_CTRL24.
*/
#define SPU0_CTRL24_CRC (SPU0_CRC_CTRL24)

/** \brief 7E0, User OCDS Trace Control */
#define SPU0_USROTC /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_USROTC*)0xFA8007E0u)

/** \brief 7E4, Access Enable Register 0 */
#define SPU0_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ACCEN0*)0xFA8007E4u)

/** \brief 7E8, Access Enable Register 1 */
#define SPU0_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ACCEN1*)0xFA8007E8u)

/** \brief 7EC, OCDS Control and Status */
#define SPU0_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_OCS*)0xFA8007ECu)

/** \brief 7F0, OCDS Debug Access Register */
#define SPU0_ODA /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_ODA*)0xFA8007F0u)

/** \brief 7F4, Kernel Reset Register 0 */
#define SPU0_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_KRST0*)0xFA8007F4u)

/** \brief 7F8, Kernel Reset Register 1 */
#define SPU0_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_KRST1*)0xFA8007F8u)

/** \brief 7FC, Kernel Reset Clear */
#define SPU0_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_KRSTCLR*)0xFA8007FCu)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXSPU_REG_H */
